esp8266/Arduino/libraries/ESP8266WebServer/src/ESP8266WebServerNew.cpp
/*
	ESP8266WebServer.cpp - Dead simple web-server.
	Supports only one simultaneous client, knows how to handle GET and POST.

	Copyright (c) 2014 Ivan Grokhotkov. All rights reserved.

	This library is free software; you can redistribute it and/or
	modify it under the terms of the GNU Lesser General Public
	License as published by the Free Software Foundation; either
	version 2.1 of the License, or (at your option) any later version.

	This library is distributed in the hope that it will be useful,
	but WITHOUT ANY WARRANTY; without even the implied warranty of
	MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
	Lesser General Public License for more details.

	You should have received a copy of the GNU Lesser General Public
	License along with this library; if not, write to the Free Software
	Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
	Modified 8 May 2015 by Hristo Gochkov (proper post and file upload handling)
*/


#include <Arduino.h>
#include <cstring>
#include <libb64/cencode.h>
#include "WiFiServer.h"
#include "WiFiClient.h"
#include "ESP8266WebServer.h"
#include "FS.h"
#include "detail/mimetable.h"

//#define DEBUG_ESP_HTTP_SERVER
#ifdef DEBUG_ESP_PORT
#define DEBUG_OUTPUT DEBUG_ESP_PORT
#else
#define DEBUG_OUTPUT Serial
#endif

namespace WebServerDarkain {

#include "detail/RequestHandlersImpl.h"

static const char AUTHORIZATION_HEADER[] /*PROGMEM*/ = "Authorization";
static const char qop_auth[] PROGMEM = "qop=auth";
static const char WWW_Authenticate[] PROGMEM = "WWW-Authenticate";
static const char Content_Length[] PROGMEM = "Content-Length";




////////////////////////////////////////////////////////////////////////////////
// INITIALIZE ALL THE THINGS
////////////////////////////////////////////////////////////////////////////////
void ESP8266WebServer::_init() {
	_currentVersion		= 0;
	_currentStatus		= HC_NONE;
	_handler			= nullptr;
	_firstHandler		= nullptr;
	_lastHandler		= nullptr;
	_contentLength		= 0;
	_chunked			= false;

	resetRequest();
}




////////////////////////////////////////////////////////////////////////////////
// CONSTRUCTOR (VARIANT 1)
////////////////////////////////////////////////////////////////////////////////
ESP8266WebServer::ESP8266WebServer(IPAddress addr, int port) : _server(addr, port) {
	_init();
}




////////////////////////////////////////////////////////////////////////////////
// CONSTRUCTOR (VARIANT 2)
////////////////////////////////////////////////////////////////////////////////
ESP8266WebServer::ESP8266WebServer(int port) : _server(port) {
	_init();
}




////////////////////////////////////////////////////////////////////////////////
// DESTRUCTOR
////////////////////////////////////////////////////////////////////////////////
ESP8266WebServer::~ESP8266WebServer() {
	_server.close();

	_headers.reset();
	_params.reset();

	RequestHandler* handler = _firstHandler;

	while (handler) {
		RequestHandler* next = handler->next();
		delete handler;
		handler = next;
	}
}




////////////////////////////////////////////////////////////////////////////////
// ??
////////////////////////////////////////////////////////////////////////////////
void ESP8266WebServer::begin() {
	close();
	_server.begin();
}




////////////////////////////////////////////////////////////////////////////////
// ??
////////////////////////////////////////////////////////////////////////////////
void ESP8266WebServer::begin(uint16_t port) {
	close();
	_server.begin(port);
}




////////////////////////////////////////////////////////////////////////////////
// ??
////////////////////////////////////////////////////////////////////////////////
String ESP8266WebServer::_extractParam(String& authReq,const String& param,const char delimit) {
	int _begin = authReq.indexOf(param);
	if (_begin == -1) {
		return "";
	}
	return authReq.substring(_begin+param.length(),authReq.indexOf(delimit,_begin+param.length()));
}




////////////////////////////////////////////////////////////////////////////////
// ??
////////////////////////////////////////////////////////////////////////////////
bool ESP8266WebServer::authenticate(const char * username, const char * password){
	if (hasHeader((AUTHORIZATION_HEADER))) {
		String authReq = header(FPSTR(AUTHORIZATION_HEADER));
		if (authReq.startsWith(F("Basic"))){
			authReq = authReq.substring(6);
			authReq.trim();
			char toencodeLen = strlen(username)+strlen(password)+1;
			char *toencode = new char[toencodeLen + 1];
			if(toencode == NULL){
				authReq = "";
				return false;
			}
			char *encoded = new char[base64_encode_expected_len(toencodeLen)+1];
			if(encoded == NULL){
				authReq = "";
				delete[] toencode;
				return false;
			}
			sprintf(toencode, "%s:%s", username, password);
			if(base64_encode_chars(toencode, toencodeLen, encoded) > 0 && authReq.equalsConstantTime(encoded)) {
				authReq = "";
				delete[] toencode;
				delete[] encoded;
				return true;
			}
			delete[] toencode;
			delete[] encoded;
		} else if (authReq.startsWith(F("Digest"))) {
			authReq = authReq.substring(7);
#			ifdef DEBUG_ESP_HTTP_SERVER
				DEBUG_OUTPUT.println(authReq);
#			endif
			String _username = _extractParam(authReq,F("username=\""));
			if (!_username.length() || _username != String(username)) {
				authReq = "";
				return false;
			}
			// extracting required parameters for RFC 2069 simpler Digest
			String _realm    = _extractParam(authReq, F("realm=\""));
			String _nonce    = _extractParam(authReq, F("nonce=\""));
			String _uri      = _extractParam(authReq, F("uri=\""));
			String _response = _extractParam(authReq, F("response=\""));
			String _opaque   = _extractParam(authReq, F("opaque=\""));

			if ((!_realm.length()) || (!_nonce.length()) || (!_uri.length()) || (!_response.length()) || (!_opaque.length())) {
				authReq = "";
				return false;
			}
			if ((_opaque != _sopaque) || (_nonce != _snonce) || (_realm != _srealm)) {
				authReq = "";
				return false;
			}
			// parameters for the RFC 2617 newer Digest
			String _nc,_cnonce;
			if (authReq.indexOf(FPSTR(qop_auth)) != -1) {
				_nc = _extractParam(authReq, F("nc="), ',');
				_cnonce = _extractParam(authReq, F("cnonce=\""));
			}
			MD5Builder md5;
			md5.begin();
			md5.add(String(username) + ':' + _realm + ':' + String(password));  // md5 of the user:realm:user
			md5.calculate();
			String _H1 = md5.toString();
#			ifdef DEBUG_ESP_HTTP_SERVER
				DEBUG_OUTPUT.println("Hash of user:realm:pass=" + _H1);
#			endif
			md5.begin();
			if(_method == HTTP_GET){
				md5.add(String(F("GET:")) + _uri);
			}else if(_method == HTTP_POST){
				md5.add(String(F("POST:")) + _uri);
			}else if(_method == HTTP_PUT){
				md5.add(String(F("PUT:")) + _uri);
			}else if(_method == HTTP_DELETE){
				md5.add(String(F("DELETE:")) + _uri);
			}else{
				md5.add(String(F("GET:")) + _uri);
			}
			md5.calculate();
			String _H2 = md5.toString();
#			ifdef DEBUG_ESP_HTTP_SERVER
				DEBUG_OUTPUT.println("Hash of GET:uri=" + _H2);
#			endif
			md5.begin();
			if(authReq.indexOf(FPSTR(qop_auth)) != -1) {
				md5.add(_H1 + ':' + _nonce + ':' + _nc + ':' + _cnonce + F(":auth:") + _H2);
			} else {
				md5.add(_H1 + ':' + _nonce + ':' + _H2);
			}
			md5.calculate();
			String _responsecheck = md5.toString();
#			ifdef DEBUG_ESP_HTTP_SERVER
				DEBUG_OUTPUT.println("The Proper response=" +_responsecheck);
#			endif
			if(_response == _responsecheck){
				authReq = "";
				return true;
			}
		}
		authReq = "";
	}
	return false;
}




////////////////////////////////////////////////////////////////////////////////
// ??
////////////////////////////////////////////////////////////////////////////////
String ESP8266WebServer::_getRandomHexString() {
	char buffer[33];  // buffer to hold 32 Hex Digit + /0
	int i;
	for(i = 0; i < 4; i++) {
		sprintf (buffer + (i*8), "%08x", RANDOM_REG32);
	}
	return String(buffer);
}




////////////////////////////////////////////////////////////////////////////////
// ??
////////////////////////////////////////////////////////////////////////////////
void ESP8266WebServer::requestAuthentication(HTTPAuthMethod mode, const char* realm, const String& authFailMsg) {
	if(realm == NULL) {
		_srealm = String(F("Login Required"));
	} else {
		_srealm = String(realm);
	}

