esp8266/Arduino/libraries/ESP8266WebServer/src/ESP8266WebServerNew.cpp
	if(mode == BASIC_AUTH) {
		sendHeader(
			String(FPSTR(WWW_Authenticate)),
			String(F("Basic realm=\"")) + _srealm + String(F("\""))
		);

	} else {
		_snonce=_getRandomHexString();
		_sopaque=_getRandomHexString();

		sendHeader(
			String(FPSTR(WWW_Authenticate)),
			String(
				F("Digest realm=\""))
				+ _srealm
				+ String(F("\", qop=\"auth\", nonce=\""))
				+ _snonce
				+ String(F("\", opaque=\""))
				+ _sopaque
				+ String(F("\"")
			)
		);
	}

	using namespace mime;
	send(HTTP_UNAUTHORIZED, String(FPSTR(mimeTable[html].mimeType)), authFailMsg);
}




////////////////////////////////////////////////////////////////////////////////
// ??
////////////////////////////////////////////////////////////////////////////////
void ESP8266WebServer::on(const String &uri, ESP8266WebServer::THandlerFunction handler) {
	on(uri, HTTP_ANY, handler);
}




////////////////////////////////////////////////////////////////////////////////
// ??
////////////////////////////////////////////////////////////////////////////////
void ESP8266WebServer::on(const String &uri, HTTPMethod method, ESP8266WebServer::THandlerFunction fn) {
	on(uri, method, fn, _fileUploadHandler);
}




////////////////////////////////////////////////////////////////////////////////
// ??
////////////////////////////////////////////////////////////////////////////////
void ESP8266WebServer::on(const String &uri, HTTPMethod method, ESP8266WebServer::THandlerFunction fn, ESP8266WebServer::THandlerFunction ufn) {
	_addRequestHandler(new FunctionRequestHandler(fn, ufn, uri, method));
}




////////////////////////////////////////////////////////////////////////////////
// ??
////////////////////////////////////////////////////////////////////////////////
void ESP8266WebServer::addHandler(RequestHandler* handler) {
	_addRequestHandler(handler);
}




////////////////////////////////////////////////////////////////////////////////
// ??
////////////////////////////////////////////////////////////////////////////////
void ESP8266WebServer::_addRequestHandler(RequestHandler* handler) {
	if (!_lastHandler) {
		_firstHandler = handler;
		_lastHandler = handler;
	} else {
		_lastHandler->next(handler);
		_lastHandler = handler;
	}
}




////////////////////////////////////////////////////////////////////////////////
// ??
////////////////////////////////////////////////////////////////////////////////
void ESP8266WebServer::serveStatic(const char* uri, FS& fs, const char* path, const char* cache_header) {
	_addRequestHandler(new StaticRequestHandler(fs, path, uri, cache_header));
}




////////////////////////////////////////////////////////////////////////////////
// ??
////////////////////////////////////////////////////////////////////////////////
void ESP8266WebServer::handleClient() {
	if (_currentStatus == HC_NONE) {
		WiFiClient client = _server.available();
		if (!client) return;

#		ifdef DEBUG_ESP_HTTP_SERVER
			DEBUG_OUTPUT.println("New client");
#		endif

		_currentClient = client;
		_currentStatus = HC_WAIT_READ;
		_statusChange = millis();
	}

	bool keepCurrentClient = false;
	bool callYield = false;

	if (_currentClient.connected()) {
		switch (_currentStatus) {
		case HC_NONE:
			// No-op to avoid C++ compiler warning
			break;

		case HC_WAIT_READ:
			// Wait for data from client to become available
			if (_currentClient.available()) {
				auto status = _parseRequest(_currentClient);
				if (status == HTTP_OK) {
					_currentClient.setTimeout(HTTP_MAX_SEND_WAIT);
					_contentLength = CONTENT_LENGTH_NOT_SET;
					_handleRequest();

					if (_currentClient.connected()) {
						_currentStatus = HC_WAIT_CLOSE;
						_statusChange = millis();
						keepCurrentClient = true;
					}
				} else {
					//SEND ERROR RESPONSE TO CLIENT
					resetRequest();
					send(status);
				}

			} else { // !_currentClient.available()
				if (millis() - _statusChange <= HTTP_MAX_DATA_WAIT) {
					keepCurrentClient = true;
				}
				callYield = true;
			}
			break;

		case HC_WAIT_CLOSE:
			// Wait for client to close the connection
			if (millis() - _statusChange <= HTTP_MAX_CLOSE_WAIT) {
				keepCurrentClient = true;
				callYield = true;
			}
		}
	}

	if (!keepCurrentClient) {
		_currentClient = WiFiClient();
		_currentStatus = HC_NONE;
		_currentUpload.reset();
	}

	if (callYield) {
		yield();
	}
}




////////////////////////////////////////////////////////////////////////////////
// ??
////////////////////////////////////////////////////////////////////////////////
void ESP8266WebServer::close() {
	_server.close();
	_currentStatus = HC_NONE;
	resetRequest();
}




////////////////////////////////////////////////////////////////////////////////
// ??
////////////////////////////////////////////////////////////////////////////////
void ESP8266WebServer::stop() {
	close();
}




////////////////////////////////////////////////////////////////////////////////
// ??
////////////////////////////////////////////////////////////////////////////////
void ESP8266WebServer::sendHeader(const String& name, const String& value, bool first) {
	//TODO: CHANGE THIS TO A SINGLE FIXED LENGTH BUFFER
	String headerLine = name;
	headerLine += F(": ");
	headerLine += value;
	headerLine += "\r\n";

	if (first) {
		_responseHeaders = headerLine + _responseHeaders;
	} else {
		_responseHeaders += headerLine;
	}
}




////////////////////////////////////////////////////////////////////////////////
// ??
////////////////////////////////////////////////////////////////////////////////
void ESP8266WebServer::setContentLength(const size_t contentLength) {
	_contentLength = contentLength;
}




////////////////////////////////////////////////////////////////////////////////
// ??
////////////////////////////////////////////////////////////////////////////////
void ESP8266WebServer::_prepareHeader(String& response, HTTPStatus code, const char* content_type, size_t contentLength) {
	response = String(F("HTTP/1.")) + String(_currentVersion) + ' ';
	response += String(code);
	response += ' ';
	response += _responseCodeToString(code);
	response += "\r\n";

	using namespace mime;
	if (!content_type) {
		content_type = mimeTable[html].mimeType;
	}

	sendHeader(String(F("Content-Type")), String(FPSTR(content_type)), true);
	if (_contentLength == CONTENT_LENGTH_NOT_SET) {
		sendHeader(String(FPSTR(Content_Length)), String(contentLength));

