esp8266/Arduino/libraries/ESP8266WebServer/src/ESP8266WebServerNew.cpp
	} else if (_contentLength != CONTENT_LENGTH_UNKNOWN) {
		sendHeader(String(FPSTR(Content_Length)), String(_contentLength));

	} else if(_contentLength == CONTENT_LENGTH_UNKNOWN && _currentVersion) { //HTTP/1.1 or above client
		//let's do chunked
		_chunked = true;
		sendHeader(String(F("Accept-Ranges")),String(F("none")));
		sendHeader(String(F("Transfer-Encoding")),String(F("chunked")));
	}

	sendHeader(String(F("Connection")), String(F("close")));

	response += _responseHeaders;
	response += "\r\n";
	_responseHeaders = "";
}




////////////////////////////////////////////////////////////////////////////////
// ??
////////////////////////////////////////////////////////////////////////////////
void ESP8266WebServer::send(HTTPStatus code, const char* content_type, const String& content) {
	String header;
	// Can we asume the following?
	//if(code == HTTP_OK && content.length() == 0 && _contentLength == CONTENT_LENGTH_NOT_SET)
	//  _contentLength = CONTENT_LENGTH_UNKNOWN;
	_prepareHeader(header, code, content_type, content.length());
	_currentClientWrite(header.c_str(), header.length());
	if(content.length()) {
		sendContent(content);
	}
}




////////////////////////////////////////////////////////////////////////////////
// ??
////////////////////////////////////////////////////////////////////////////////
void ESP8266WebServer::send_P(HTTPStatus code, PGM_P content_type, PGM_P content) {
	size_t contentLength = 0;

	if (content != NULL) {
		contentLength = strlen_P(content);
	}

	String header;
	char type[64];
	memccpy_P((void*)type, (PGM_VOID_P)content_type, 0, sizeof(type));
	_prepareHeader(header, code, (const char* )type, contentLength);
	_currentClientWrite(header.c_str(), header.length());
	sendContent_P(content);
}




////////////////////////////////////////////////////////////////////////////////
// ??
////////////////////////////////////////////////////////////////////////////////
void ESP8266WebServer::send_P(HTTPStatus code, PGM_P content_type, PGM_P content, size_t contentLength) {
	String header;
	char type[64];
	memccpy_P((void*)type, (PGM_VOID_P)content_type, 0, sizeof(type));
	_prepareHeader(header, code, (const char* )type, contentLength);
	sendContent(header);
	sendContent_P(content, contentLength);
}




////////////////////////////////////////////////////////////////////////////////
// ??
////////////////////////////////////////////////////////////////////////////////
void ESP8266WebServer::send(HTTPStatus code, char *content_type, const String &content) {
	send(code, (const char*)content_type, content);
}




////////////////////////////////////////////////////////////////////////////////
// ??
////////////////////////////////////////////////////////////////////////////////
void ESP8266WebServer::send(HTTPStatus code, const String &content_type, const String &content) {
	send(code, (const char*)content_type.c_str(), content);
}




////////////////////////////////////////////////////////////////////////////////
// ??
////////////////////////////////////////////////////////////////////////////////
void ESP8266WebServer::sendContent(const String& content) {
	const char *footer = "\r\n";
	size_t len = content.length();
	if (_chunked) {
		char * chunkSize = (char *)malloc(11);
		if (chunkSize) {
			sprintf(chunkSize, "%x%s", len, footer);
			_currentClientWrite(chunkSize, strlen(chunkSize));
			free(chunkSize);
		}
	}
	_currentClientWrite(content.c_str(), len);
	if (_chunked) {
		_currentClient.write(footer, 2);
		if (len == 0) {
			_chunked = false;
		}
	}
}




////////////////////////////////////////////////////////////////////////////////
// ??
////////////////////////////////////////////////////////////////////////////////
void ESP8266WebServer::sendContent_P(PGM_P content) {
	sendContent_P(content, strlen_P(content));
}




////////////////////////////////////////////////////////////////////////////////
// ??
////////////////////////////////////////////////////////////////////////////////
void ESP8266WebServer::sendContent_P(PGM_P content, size_t size) {
	const char *footer = "\r\n";
	if (_chunked) {
		char *chunkSize = (char*) malloc(11);
		if (chunkSize) {
			sprintf(chunkSize, "%x%s", size, footer);
			_currentClientWrite(chunkSize, strlen(chunkSize));
			free(chunkSize);
		}
	}
	_currentClientWrite_P(content, size);
	if (_chunked) {
		_currentClient.write(footer, 2);
		if (size == 0) {
			_chunked = false;
		}
	}
}





////////////////////////////////////////////////////////////////////////////////
// ??
////////////////////////////////////////////////////////////////////////////////
void ESP8266WebServer::_streamFileCore(const size_t fileSize, const String & fileName, const String & contentType) {
	using namespace mime;
	setContentLength(fileSize);
	if (fileName.endsWith(String(FPSTR(mimeTable[gz].endsWith))) &&
			contentType != String(FPSTR(mimeTable[gz].mimeType)) &&
			contentType != String(FPSTR(mimeTable[none].mimeType))) {
		sendHeader(F("Content-Encoding"), F("gzip"));
	}
	send(HTTP_OK, contentType, "");
}




////////////////////////////////////////////////////////////////////////////////
// ??
////////////////////////////////////////////////////////////////////////////////
void ESP8266WebServer::onFileUpload(THandlerFunction fn) {
	_fileUploadHandler = fn;
}




////////////////////////////////////////////////////////////////////////////////
// ??
////////////////////////////////////////////////////////////////////////////////
void ESP8266WebServer::onNotFound(THandlerFunction fn) {
	_notFoundHandler = fn;
}




////////////////////////////////////////////////////////////////////////////////
// ??
////////////////////////////////////////////////////////////////////////////////
void ESP8266WebServer::_handleRequest() {
	bool handled = false;
	if (!_handler){
#		ifdef DEBUG_ESP_HTTP_SERVER
			DEBUG_OUTPUT.println("request handler not found");
#		endif
	}
	else {
		handled = _handler->handle(*this, _method, _requestPath);
#		ifdef DEBUG_ESP_HTTP_SERVER
			if (!handled) {
				DEBUG_OUTPUT.println("request handler failed to handle request");
			}
#		endif
	}
	if (!handled && _notFoundHandler) {
		_notFoundHandler();
		handled = true;
	}
	if (!handled) {
		using namespace mime;
		send(HTTP_NOT_FOUND, String(FPSTR(mimeTable[html].mimeType)), String(F("Not found: ")) + _requestPath);
		handled = true;
	}
	if (handled) {
		_finalizeResponse();
	}
	_requestPath = "";
}




////////////////////////////////////////////////////////////////////////////////
// ??
////////////////////////////////////////////////////////////////////////////////
void ESP8266WebServer::_finalizeResponse() {
	if (_chunked) {
		sendContent("");
	}
}




////////////////////////////////////////////////////////////////////////////////
// ??
////////////////////////////////////////////////////////////////////////////////
String ESP8266WebServer::_responseCodeToString(HTTPStatus code) {
	switch (code) {
		case HTTP_CONTINUE:				return F("Continue");
		case HTTP_SWITCH_PROTO:			return F("Switching Protocols");
		case HTTP_OK:					return F("OK");
		case HTTP_CREATED:				return F("Created");
		case HTTP_ACCEPTED:				return F("Accepted");
		case HTTP_NON_AUTH_INFO:		return F("Non-Authoritative Information");
		case HTTP_NO_CONTENT:			return F("No Content");
		case HTTP_RESET_CONTENT:		return F("Reset Content");
		case HTTP_PARTIAL_CONTENT:		return F("Partial Content");
		case HTTP_IM_USED:				return F("IM Used");
		case HTTP_MULTIPLE_CHOICE:		return F("Multiple Choices");
		case HTTP_MOVED_PERM:			return F("Moved Permanently");
		case HTTP_FOUND:				return F("Found");
		case HTTP_SEE_OTHER:			return F("See Other");
		case HTTP_NOT_MODIFIED:			return F("Not Modified");
		case HTTP_USE_PROXY:			return F("Use Proxy");
		case HTTP_SWITCH_PROXY:			return F("Switch Proxy");
		case HTTP_TEMP_REDIRECT:		return F("Temporary Redirect");
		case HTTP_PERM_REDIRECT:		return F("Permanent Redirect");
		case HTTP_BAD_REQUEST:			return F("Bad Request");
		case HTTP_UNAUTHORIZED:			return F("Unauthorized");
		case HTTP_PAYMENT_REQ:			return F("Payment Required");
		case HTTP_FORBIDDEN:			return F("Forbidden");
		case HTTP_NOT_FOUND:			return F("Not Found");
		case HTTP_NOT_ALLOWED:			return F("Method Not Allowed");
		case HTTP_NOT_ACCEPTABLE:		return F("Not Acceptable");
		case HTTP_PROXY_AUTH_REQ:		return F("Proxy Authentication Required");
		case HTTP_TIMEOUT:				return F("Request Timeout");
		case HTTP_CONFLICT:				return F("Conflict");
		case HTTP_GONE:					return F("Gone");
		case HTTP_LENGTH_REQ:			return F("Length Required");
		case HTTP_PRECON_FAIL:			return F("Precondition Failed");
		case HTTP_PAYLOAD_LARGE:		return F("Payload Too Large");
		case HTTP_URI_LARGE:			return F("URI Too Long");
		case HTTP_UNSUPPORT_MEDIA:		return F("Unsupported Media Type");
		case HTTP_RANGE_ERROR:			return F("Range Not Satisfiable");
		case HTTP_EXPECATION_FAIL:		return F("Expectation Failed");
		case HTTP_TEAPOT:				return F("I'm a teapot");
		case HTTP_MISDIRECT_REQUEST:	return F("Misdirected Request");
		case HTTP_TOO_MANY_REQUEST:		return F("Too Many Requests");
		case HTTP_REQUEST_LARGE:		return F("Request Header Fields Too Large");
		case HTTP_SERVER_ERROR:			return F("Internal Server Error");
		case HTTP_NOT_IMPLEMENTED:		return F("Not Implemented");
		case HTTP_BAD_GATEWAY:			return F("Bad Gateway");
		case HTTP_UNAVAILABLE:			return F("Service Unavailable");
		case HTTP_GATEWAY_TIMEOUT:		return F("Gateway Time-out");
		case HTTP_VERSION_UNSUPPORTED:	return F("HTTP Version not supported");
	}

	return F("");
}

}; // namespace WebServerDarkain
